Repository: dpinones/dojo-book
Catalog: po/*.po
Languages: es

source: Start by installing Rust and running the test suite to confirm your setup:
es: Comienza instalando Rust y ejecutando el conjunto de pruebas para confirmar la configuración:

source: > Note: Depending on your Linux distribution, you may need to install additional dependencies. Make sure to install any suggested or missing dependencies that arise during the setup process.
es: > Nota: Dependiendo de la distribución de Linux que estés usando, es posible que necesites instalar dependencias adicionales. Asegúrate de instalar todas las dependencias sugeridas o faltantes que surjan durante el proceso de configuración.

source: #### 2. Install Scarb Package Manager
es: #### 2. Instalar el administrador de paquetes Scarb

source: Next, install the [Scarb](https://docs.swmansion.com/scarb) package manager by running:
es: Luego, instala el gestor de paquetes [Scarb](https://docs.swmansion.com/scarb) ejecutando el siguiente comando:

source: #### 3. Setup Cairo VSCode Extension
es: #### 3. Configura la extensión de Cairo para Visual Studio Code

source: For proper linting and syntax highlighting, you should install the Cairo 1.0 extension for Visual Studio Code.
es: Para obtener un correcto resaltado de sintaxis y linting, debes instalar la extensión de Cairo 1.0 para Visual Studio Code.

source: - Clone the Cairo repository somewhere on your machine (make sure not to clone within the Dojo directory).
es: - Clona el repositorio de Cairo en algún lugar de tu máquina (asegúrate de no clonarlo dentro del directorio de Dojo).

source: - Install the Cairo Language Server extension. Here's a step-by-step guide, or you can follow the [official instructions](https://github.com/starkware-libs/cairo/blob/main/vscode-cairo/README.md).
es: - Instala la extensión Cairo Language Server. Aquí tienes una guía paso a paso, o puedes seguir las [instrucciones oficiales](https://github.com/starkware-libs/cairo/blob/main/vscode-cairo/README.md).

source: Navigate to the vscode-cairo directory:
es: Navega al directorio vscode-cairo:

source: Install the required packages:
es: Instala los paquetes necesarios:

source: Package the extension:
es: Empaqueta la extensión:

source: Install the extension:
es: Instala la extensión:

source: > **Mac Tip:** If you don't have the `code` command, in VSCode do `Cmd+Shift+P` and type 'shell command' to find the Shell Command: Install 'code' command in PATH command.
es: > **Mac Tip:** Si no tienes el comando `code`, en VSCode presiona `Cmd+Shift+P` y escribe 'shell command' para encontrar el comando: Instale el comando 'code' en el PATH.

source: The Cairo language server should now be installed globally in your Visual Studio Code. If you have the server enabled, Scarb should automatically pick this up and start linting your Cairo files.
es: El servidor de lenguaje de Cairo debería estar instalado globalmente en tu Visual Studio Code ahora. Si tienes el servidor habilitado, Scarb debería detectarlo automáticamente y comenzar a realizar el análisis de estilo en tus archivos de Cairo.

source: _Coming soon_
es: _Próximamente_

source: ### Container
es: ### Contenedor

source: - [Overview](./framework/cairo/overview.md) - [World](./framework/cairo/world.md) - [Components](./framework/cairo/components.md) - [Systems](./framework/cairo/systems.md) - [Entities](./framework/cairo/entities.md) - [Commands](./framework/cairo/commands.md) - [Storage](./framework/cairo/storage.md)
es: - [Visión general](./framework/cairo/overview.md) - [Mundo](./framework/cairo/world.md) - [Componentes](./framework/cairo/components.md) - [Sistemas](./framework/cairo/systems.md) - [Entidades](./framework/cairo/entities.md) - [Comandos](./framework/cairo/commands.md) - [Almacenamiento](./framework/cairo/storage.md)

source: ### Tooling
es: ### Herramientas

source: Dojo comes with batteries included to power your games. There are 3 core tools which you will use to build your worlds.
es: Dojo viene con herramientas incluidas para impulsar tus juegos. Hay 3 herramientas principales que utilizarás para construir tus mundos.

source: ## Overview
es: ## Visión general

source: Dojo employs the ECS (Entity Component System) as an architectural pattern to efficiently manage and organize the state and behavior of Autonomous Worlds (AWs). In this pattern, computation is defined as a list of systems operating on a set of entities, each of which consists of a dynamic set of pure data components. Systems select the entities to process via persistent and efficient queries over the entities' components.
es: Dojo utiliza el ECS (Sistema de Componentes de Entidades) como un patrón arquitectónico para gestionar, organizar eficientemente el estado y el comportamiento de los Mundos Autónomos (AWs). En este patrón, la computación se define como una lista de sistemas que operan sobre un conjunto de entidades, cada una de las cuales consta de un conjunto dinámico de componentes de datos puros. Los sistemas seleccionan las entidades a procesar mediante consultas persistentes y eficientes sobre los componentes de las entidades.

source: It is worth reading this excellent [FAQ](https://github.com/SanderMertens/ecs-faq) on ECS
es: Vale la pena leer esta excelente [FAQ](https://github.com/SanderMertens/ecs-faq) sobre el ECS

source: ### Understanding the ECS in Dojo
es: ### Comprendiendo el ECS en Dojo

source: The Entity Component System (ECS) forms the backbone of the Dojo engine. Here's an overview of its core elements:
es: El Sistema de Componentes de Entidades (ECS) es el corazón del motor de Dojo. Aquí tienes una descripción general de sus elementos principales:

source: 1. **Entities**: Unique objects that can bear multiple components. They are identifiable through unique IDs. 2. **Components**: Diverse attributes of an entity, such as geometry, physics, and hit points. Components are exclusively responsible for data storage. 3. **Systems**: Segments of code that manage entities and alter components. 4. **Queries**: Utilized by systems to select entities based on the associated components. 5. **World**: A comprehensive container for entities, components, systems, and queries.
es: 1. **Entidades**: Objetos únicos que pueden tener múltiples componentes. Se identifican mediante identificadores únicos (IDs). 2. **Componentes**: Diversos atributos de una entidad, como geometría, física y puntos de vida. Los componentes son exclusivamente responsables del almacenamiento de datos. 3. **Sistemas**: Segmentos de código que administran entidades y modifican componentes. 4. **Consultas (Queries)**: Utilizadas por los sistemas para seleccionar entidades en función de los componentes asociados. 5. **Mundo (World)**: Un contenedor completo para entidades, componentes, sistemas y consultas.

source: ### Building an Autonomous World with Dojo
es: ### Construyendo un Mundo Autónomo con Dojo

source: Follow these steps to effectively create a Dojo world:
es: Sigue estos pasos para crear eficazmente un mundo con Dojo:

source: 1. **Conceptualize Entities**: Visualize the entities that will populate your world. 2. **Recognize Shared Attributes**: Determine common characteristics of your entities, such as position, name, or health. 3. **Construct Reusable Components**: Create versatile components derived from these shared attributes. 4. **Develop Specialized Systems**: Design systems that are adept at performing a specific task.
es: 1. **Conceptualiza las Entidades**: Visualiza las entidades que poblarán tu mundo. 2. **Identifica Atributos Compartidos**: Determina las características comunes de tus entidades, como posición, nombre o salud. 3. **Construye Componentes Reutilizables**: Crea componentes versátiles derivados de estos atributos compartidos. 4. **Desarrolla Sistemas Especializados**: Diseña sistemas que sean hábiles para realizar tareas específicas.

source: To illustrate, here's an example of a basic design that utilizes components and systems to create four distinct entities:
es: Para ilustrar, aquí tienes un ejemplo de un diseño básico que utiliza componentes y sistemas para crear cuatro entidades distintas:

source: ## World
es: ## Mundo

source: The world contract functions as a central system kernel, serving as the foundation for initiating and resolving all interactions. Within this kernel, contracts are deployed, registered, and executed, streamlining the process for downstream systems by enabling clients to engage with a single contract rather than potentially hundreds.
es: El contrato del mundo funciona como el núcleo central del sistema, sirviendo como base para iniciar y resolver todas las interacciones. Dentro de este núcleo, se despliegan, registran y ejecutan contratos, agilizando el proceso para los sistemas secundarios al permitir que los clientes interactúen con un solo contrato en lugar de potencialmente cientos.

source: > **To think about:** Consider Autonomous Worlds as sovereign blockchains residing within another blockchain - a nested blockchain, so to speak. Just as you can deploy contracts onto Ethereum to enhance its functionality, you can similarly introduce systems into the World contract to enrich its features. While anyone can contribute to the World, akin to Ethereum, authorization is required to interact with component state. There is a dedicated topic to Authorisation.
es: > **Para tener en cuenta:** Considera los Mundos Autónomos como blockchains soberanas que residen dentro de otra blockchain, una blockchain anidada, por así decirlo. Así como puedes desplegar contratos en Ethereum para mejorar su funcionalidad, de manera similar puedes introducir sistemas en el contrato del Mundo para enriquecer sus características. Si bien cualquiera puede contribuir al Mundo, al igual que en Ethereum, se requiere autorización para interactuar con el estado de los componentes. Existe un tema dedicado a la Autorización.

source: ## Authorization
es: ## Autorización

source: As discussed in the [World](./world.md) chapter, Autonomous Worlds (AWs) function as sovereign chains nested within a public blockchain. These Worlds are also open to the public. This structure allows anyone to enhance a World by deploying components or systems. However, this openness brings security considerations. Similar to Ethereum, interacting with a component state by a System requires appropriate authorization by the component owner.
es: Como se discutió en el capítulo [World](./world.md), los Mundos Autónomos (AWs) funcionan como cadenas soberanas anidadas dentro de una cadena pública de bloques. Estos Mundos también están abiertos al público. Esta estructura permite que cualquier persona mejore un Mundo mediante el despliegue de componentes o sistemas. Sin embargo, esta apertura también conlleva consideraciones de seguridad. Al igual que en Ethereum, interactuar con el estado de un componente mediante un Sistema requiere una autorización adecuada por parte del propietario del componente.

source: ### Architecture
es: ### Arquitectura

source: __todo__
es: __Próximamente__

source: ### Usage
es: ### Uso del motor de Dojo

source: ## Components
es: ## Componentes

source: Components serve as the foundation for defining the world's structure, encapsulating state for systems to mutate. For instance, a Position component can be implemented as a struct, exposing `is_zero` and `is_equal` methods. Dojo compiles these components into contracts that can be declared and installed within a world, enabling the creation of diverse and customizable environments.
es: Los componentes sirven como base para definir la estructura del mundo, encapsulando el estado para que los sistemas puedan modificarlo. Por ejemplo, un componente de Posición se puede implementar como una estructura, exponiendo métodos como `is_zero` e `is_equal`. Dojo compila estos componentes en contratos que pueden ser declarados e instalados dentro de un mundo, lo que permite la creación de entornos diversos y personalizables.

source: When designing a world's components, it is crucial to carefully consider the abstractions you create, always keeping composability in mind.
es: Al diseñar los componentes de un mundo, es crucial considerar cuidadosamente las abstracciones que se crean, manteniendo siempre en mente la composabilidad.

source: Suppose you plan to create two entities that move around the map and are fundamentally different from each other, except for the fact that they both exist within the world. In this case, you could create a shared Position component for both entities. This demonstrates the power of the Entity Component System (ECS) abstraction: by writing a single component, you can reuse it across multiple diverse entities, promoting modularity and flexibility within your world design.
es: Supongamos que planeas crear dos entidades que se mueven por el mapa y son fundamentalmente diferentes entre sí, excepto por el hecho de que ambas existen dentro del mundo. En este caso, podrías crear un componente de "Posición" compartido para ambas entidades. Esto demuestra el poder de la abstracción del Sistema de Componentes de Entidades(ECS): al escribir un solo componente, puedes reutilizarlo en múltiples entidades diversas, fomentando la modularidad y flexibilidad en el diseño de tu mundo.

source: ## Systems
es: ## Sistemas

source: Systems represent functions that operate on the world state. They take input from the user, retrieve the current state from the world, compute a state transition, and apply it. Each system has a single entry point, the execute function. To streamline interaction with the world, systems can utilize commands.
es: Los Sistemas representan funciones que operan sobre el estado del mundo. Toman información del usuario, obtienen el estado actual del mundo, calculan una transición de estado y la aplican. Cada sistema tiene un único punto de entrada, la función `execute`. Para simplificar la interacción con el mundo, los sistemas pueden utilizar comandos.

source: ## Entities
es: ## Entidades

source: A common misconception for those new to ECS systems is the way entities exist within the World. Different ECS systems handle entities in various ways. In Dojo, entities are treated as a primary key value within the world, to which components can be attached. To illustrate this concept, consider a simple example of a character in a game that has a position and a health component.
es: Una idea errónea común para aquellos que son nuevos en los sistemas ECS es la forma en que las entidades existen dentro del mundo. Diferentes sistemas ECS manejan las entidades de diversas formas. En Dojo, las entidades se tratan como un valor de clave primaria dentro del mundo, a la cual se pueden adjuntar componentes. Para ilustrar este concepto, consideremos un ejemplo sencillo de un personaje en un juego que tiene un componente de posición y un componente de salud.

source: When defining the components for this entity, it is important to note that we do not reference the entity directly. Instead, we simply provide two structs that the entity will contain. This approach emphasizes the flexibility and composability of the ECS system, allowing for the easy creation and modification of entities with various combinations of components.
es: Al definir los componentes para esta entidad, es importante tener en cuenta que no hacemos referencia directa a la entidad. En su lugar, simplemente proporcionamos dos estructuras que contendrá la entidad. Este enfoque enfatiza la flexibilidad y la composabilidad del sistema ECS, lo que permite la fácil creación y modificación de entidades con diversas combinaciones de componentes.

source: Now, let's create a `SpawnSystem` for the character. It is important to note that we have not explicitly defined an Entity anywhere. Instead, the system will assign a primary key ID to the entity when this system is executed.
es: Ahora, creemos un `SpawnSystem` para el personaje. Es importante tener en cuenta que no hemos definido explícitamente una entidad en ningún lugar. En su lugar, el sistema asignará un ID de clave primaria a la entidad cuando se ejecute este sistema.

source: Finally, lets move the character with the `MoveSystem`.
es: Finalmente, movamos al personaje con el `MoveSystem`.

source: ## Commands
es: ## Comandos

source: Commands in Dojo are generalized functions that are expanded at compile time to facilitate system execution. They provide a convenient way for systems to interact with the world state by abstracting common operations, such as retrieving or updating components, and generating unique IDs. By leveraging these commands, developers can streamline their system implementations and improve code readability.
es: Los comandos en Dojo son funciones generalizadas que se expanden en tiempo de compilación para facilitar la ejecución de sistemas. Proporcionan una forma conveniente para que los sistemas interactúen con el estado del mundo al abstraer operaciones comunes, como obtener o actualizar componentes, y generar IDs únicos. Al aprovechar estos comandos, los desarrolladores pueden simplificar sus implementaciones de sistemas y mejorar la legibilidad del código.

source: Understanding commands is key to understanding Dojo. You will leverage them heavily within the systems you design.
es: Entender los comandos es clave para comprender Dojo. Los utilizarás ampliamente en los sistemas que diseñes.

source: # Storage
es: # Almacenamiento

source: In a Dojo Autonomous World, the `World` contract serves as the central store that manages and maintains the overall state. No state is maintained at the component level, this allows a clean split in logic and state. Most developers will not need to touch the storage methods, every part of the world can just be maintained via the [commands](./commands.md).
es: En un Mundo Autónomo de Dojo, el contrato `World` sirve como la tienda central que administra y mantiene el estado general. No se mantiene ningún estado a nivel de componente, lo que permite una división clara entre la lógica y el estado. La mayoría de los desarrolladores no necesitarán manipular los métodos de almacenamiento, ya que cada parte del mundo puede ser gestionada mediante los [comandos](./commands.md).

source: ## Detailed overview of Storage
es: ## Descripción detallada del Almacenamiento

source: State is maintained via a generated partition when you create a component. The compiler calculates the size of the component along with the key you have used and creates a partition within the world. Think of the partition as a table which can be read from and written to.
es: El estado se mantiene mediante una partición generada al crear un componente. El compilador calcula el tamaño del componente junto con la clave que has utilizado, y crea una partición dentro del mundo. Puedes pensar en la partición como una tabla a la cual se puede leer y escribir.

source: `sozo` is a powerful migration planning tool designed to streamline the updating and deployment of AWs. It provides a robust binary command-line interface (CLI) that simplifies World management tasks, enabling you to focus on the creative aspects of World-building. Future versions will provide a GUI.
es: `sozo` es una poderosa herramienta de planificación de migraciones diseñada para agilizar la actualización y el despliegue de los AWs (Mundos Autónomos). Proporciona una interfaz de línea de comandos (CLI) binaria sólida que simplifica las tareas de gestión del Mundo, permitiéndote centrarte en los aspectos creativos de la construcción de Mundos. En futuras versiones, se proporcionará una interfaz gráfica de usuario (GUI).

source: ## Features
es: ## Características

source: - **Binary CLI**: Sozo provides an intuitive binary CLI, ensuring easy management of your Worlds, whether you're updating existing ones or deploying new ones.
es: - **Binary CLI**: Sozo ofrece una intuitiva interfaz de línea de comandos (CLI), asegurando una fácil gestión de tus Mundos, ya sea que estés actualizando los existentes o desplegando nuevos.

source: The `sozo` binary can be installed via [`dojoup`](../../getting-started/installation.md#using-dojoup), our dedicated installation package manager.
es: El binario `sozo` puede ser instalado a través de [`dojoup`](../../getting-started/installation.md#using-dojoup), nuestro gestor de paquetes de instalación dedicado.

source: ### Installing from Source
es: ### Instalación desde el código fuente

source: If you prefer to install from the source code:
es: Si prefieres instalar desde el código fuente:

source: This will install Sozo and the required dependencies on your local system.
es: Esto instalará Sozo y las dependencias requeridas en tu sistema local.

source: > 📚 **Reference** > > See the [`sozo` Reference](../../reference/sozo/) for a complete overview of all the available subcommands.
es: > 📚 **Referencia** > > Consulta la referencia de [sozo](../../reference/sozo/) para obtener una visión completa de todos los subcomandos disponibles.

source: `katana` is a _blazingly fast_ local Starknet node, designed to support local development with Dojo.
es: `katana` es un nodo de Starknet _extremadamente rápido_, diseñado para admitir el desarrollo local con Dojo.

source: ### Features
es: ### Características

source: - [Starknet JSON-RPC v0.3.0](https://github.com/starkware-libs/starknet-specs/tree/v0.3.0) support
es: - Soporte para [Starknet JSON-RPC v0.3.0](https://github.com/starkware-libs/starknet-specs/tree/v0.3.0)

source: `katana` binary is available via [`dojoup`](../../getting-started/installation.md#using-dojoup).
es: El binario `katana` está disponible a través de [`dojoup`](../../getting-started/installation.md#using-dojoup).

source: ### Installing from source
es: ### Instalación desde el código fuente

source: > 📚 **Reference** > > See the [`katana` Reference](../../reference/katana/) for in depth information on Anvil and its capabilities.
es: > 📚 **Referencia** > > Consulta la referencia de [katana](../../reference/katana/) para obtener información detallada sobre Anvil y sus capacidades.

source: ## Torii - Networking & Indexing
es: ## Torii - Redes e Indexación

source: Torii serves as a comprehensive indexing and networking layer for dojo worlds. It systematically organizes the state of dojo worlds, facilitating efficient querying for clients.
es: Torii actúa como una capa completa de indexación y redes para los mundos de Dojo. Organiza sistemáticamente el estado de los mundos de Dojo, facilitando consultas eficientes para los clientes.

source: ### Indexer
es: ### Indexación

source: __coming soon__
es: __Próximamente__

source: ## References
es: ## Referencias

source: - [sozo Commands](./sozo/) - [katana Reference](./katana/)
es: - [Comandos sozo](./sozo/) - [Referencias katana](./katana/)

source: ## sozo Commands
es: ## Comandos de sozo

source: - [Project Commands](./project-commands.md) - [World Commands](./world-commands.md)
es: - [Comandos de Proyecto](./project-commands.md) - [Comandos de Mundo](./world-commands.md)

source: ## Project Commands
es: ## Comandos de Proyecto

source: ## World Commands
es: ## Comandos de Mundo

source: ### NAME
es: ### NOMBRE

source: katana - Create a local testnet node for deploying and testing Starknet smart contracts.
es: katana - es una herramienta que te permite crear un nodo de testnet local para implementar y probar contratos inteligentes de Starknet.

source: ### SYNOPSIS
es: ### SINOPSIS

source: ### DESCRIPTION
es: ### DESCRIPCIÓN

source: Create a local testnet node for deploying and testing Starknet smart contracts. Katana supports deployment and execution of version 0 and 1 of Cairo contracts.
es: Crea un nodo de testnet local para desplegar y probar contratos inteligentes de Starknet. Katana admite el despliegue y la ejecución de la versión 0 y 1 de contratos de Cairo.
