Repository: dpinones/dojo-book
Catalog: po/*.po
Languages: es

source: Introduction
es: Introducción

source: AW Theory
es: Teoría AW

source: Cairo Ecosystem
es: Ecosistema de Cairo

source: Getting Started
es: Primeros pasos

source: Installation
es: Instalación

source: Development
es: Desarrollo

source: Setup
es: Configuración

source: Dojo Engine
es: Motor de Dojo

source: Overview
es: Visión general

source: World
es: Mundo

source: Authorization
es: Autorización

source: Components
es: Componentes

source: Systems
es: Sistemas

source: Entities
es: Entidades

source: Commands
es: Comandos

source: Storage
es: Almacenamiento

source: Appendix
es: Apéndice

source: References
es: Referencias

source: sozo Commands
es: Comandos de sozo

source: Project Commands
es: Comandos del Proyecto

source: World Commands
es: Comandos del Mundo

source: katana Reference
es: referencia de katana

source: Contributors
es: Colaboradores

source: ## Dojo: The provable games engine
es: ## Dojo: El motor de juegos demostrables

source: This guide is dedicated to familiarizing you with the Dojo engine and the transformative potential of Provable games. A special section on the [Theory](./theory/autonomous-worlds.md) elucidates this emergent concept of autonomous worlds and Provable games.
es: Esta guía está dedicada a familiarizarte con el motor de Dojo y el potencial transformador de los juegos demostrables. Una sección especial sobre la [Teoría](./theory/autonomous-worlds.md) que aclara este emergente concepto de mundos autónomos y juegos probables.

source: ## What is Dojo?
es: ## ¿Qué es Dojo?

source: Dojo is a provable game engine with an integrated toolchain, designed for creating onchain games and autonomous worlds using [Cairo 1.0](https://github.com/starkware-libs/cairo). It employs an [entity component system](https://en.wikipedia.org/wiki/Entity_component_system) and a [diamond pattern](https://eips.ethereum.org/EIPS/eip-2535), facilitating a modular, scalable world. Worlds grow via the addition of Components (state) and Systems (logic). Our architectural design is greatly influenced by the brilliant [Bevy](https://bevyengine.org/) engine.
es: Dojo es un motor de juegos demostrables con una herramienta integrada, diseñada para crear juegos y mundos autónomos en la cadena de bloques utilizando [Cairo 1.0](https://github.com/starkware-libs/cairo). Emplea un [sistema de componentes de entidades](https://en.wikipedia.org/wiki/Entity_component_system) y el [patrón diamante](https://eips.ethereum.org/EIPS/eip-2535), facilitando un mundo modular y escalable. Los mundos crecen mediante la adición de Componentes (estado) y Sistemas (lógica). Nuestro diseño arquitectónico está fuertemente influenciado por el brillante motor [Bevy](https://bevyengine.org/).

source: Here's a video of [Cartridge](https://cartridge.gg/)'s [Tarrence](https://twitter.com/tarrenceva) explaining how Dojo works at the 2023 [Autonomous Anonymous Summit](https://twitter.com/pet3rpan_/status/1666764726427353091):
es: Aquí tienes un video de [Cartridge](https://cartridge.gg/) donde [Tarrence](https://twitter.com/tarrenceva) explica cómo funciona Dojo en la [Autonomous Anonymous Summit 2023](https://twitter.com/pet3rpan_/status/1666764726427353091):

source: #### Key Features
es: #### Características clave

source: - Entity Component System (ECS) built on [Cairo 1.0](https://github.com/starkware-libs/cairo) - [Sozo](./framework/sozo/overview.md) world migration planner - [Torii](./framework/torii/overview.md) networking and indexing stack - [Katana](./framework/katana/overview.md) RPC development network - Typed SDKs
es: - Sistema de Componentes de Entidades (ECS) construido en [Cairo 1.0](https://github.com/starkware-libs/cairo) - [Sozo](./framework/sozo/overview.md) planificador de migraciones de mundos - [Torii](./framework/torii/overview.md) pila de red e indexación - [Katana](./framework/katana/overview.md) red de desarrollo RPC - SDKs tipados

source: > Dojo is an open-source project, currently in its early development phase, and warmly welcomes contributors. For additional resources, find the book on [Github](https://github.com/dojoengine/book).
es: > Dojo es un proyecto de código abierto, actualmente en su fase inicial de desarrollo, y da una cálida bienvenida a los colaboradores. Para obtener recursos adicionales, encuentra el libro en [Github](https://github.com/dojoengine/book).

source: ### Why Dojo?
es: ### ¿Por qué Dojo?

source: Dojo is the culmination of lessons learned from attempts at building [onchain games](https://naavik.co/digest/primer-fully-on-chain-gaming), an emerging sector in the gaming industry. Any developer who has endeavored to build an onchain game appreciates the inherent engineering hurdles - a realization that drove us to create Dojo. Just as you wouldn't recreate Unity every time you develop a new game, the same principle applies here. Dojo is designed to handle the complex infrastructure, allowing developers to focus on the unique aspects of their games.
es: Dojo es el resultado de las lecciones aprendidas de intentos de construir [juegos en cadena](https://naavik.co/digest/primer-fully-on-chain-gaming), un sector emergente en la industria de los videojuegos. Cualquier desarrollador que haya intentado crear un juego en cadena aprecia los desafíos de ingeniería inherentes, una realidad que nos impulsó a crear Dojo. Así como no recrearías Unity cada vez que desarrollas un nuevo juego, el mismo principio se aplica aquí. Dojo está diseñado para manejar la infraestructura compleja, permitiendo a los desarrolladores enfocarse en los aspectos únicos de sus juegos.

source: ### Why Cairo & Starknet?
es: ### ¿Por qué Cairo y StarkNet?

source: Provable games demand [zero-knowledge](https://ethereum.org/en/zero-knowledge-proofs/) properties for efficient scaling and verification of computations. [Cairo](https://book.starknet.io/chapter_1/what_is_cairo.html) addresses this need by providing a generalized language, eliminating the complexity of creating circuits to incorporate [SNARKs](https://consensys.net/blog/developers/introduction-to-zk-snarks/).
es: Los juegos demostrables requieren propiedades de [conocimiento cero](https://ethereum.org/en/zero-knowledge-proofs/)(ZK) para una escalabilidad eficiente y verificación de cálculos. [Cairo](https://book.starknet.io/chapter_1/what_is_cairo.html) aborda esta necesidad proporcionando un lenguaje generalizado, eliminando la complejidad de crear circuitos para incorporar [SNARKs](https://consensys.net/blog/developers/introduction-to-zk-snarks/).

source: **You can simply program in Cairo and your applications become automatically provable**.
es: **Puedes simplemente programar en Cairo y tus aplicaciones se vuelven automáticamente demostrables**.

source: Moreover, you can deploy your programs on the [Cairo Virtual Machine](https://medium.com/starkware/cairo-welcome-on-board-1cf3487554f) (CVM), which is compatible with Starknet's Layer 2, Starknet appchains, and even in-browser through WebAssembly (WASM)! Dojo aims to supply straightforward ZK primitives to fuel your game development.
es: Además, puedes implementar tus programas en la [Máquina Virtual Cairo](https://medium.com/starkware/cairo-welcome-on-board-1cf3487554f) (CVM), que es compatible con la Capa 2 de Starknet, las appchains de Starknet e incluso en el navegador a través de WebAssembly (WASM). Dojo tiene como objetivo proporcionar primitivas de conocimiento cero sencillas(ZK) para impulsar el desarrollo de tus juegos.

source: For more information about Starknet, Cairo and its tech stack, check out the [Starknet & Cairo book](https://book.starknet.io/).
es: Para obtener más información sobre Starknet, Cairo y su stack tecnológico, visita el [libreo de Starknet y Cairo](https://book.starknet.io/).

source: ### Vision
es: ### Visión

source: Dojo is a bold work in progress, aimed at empowering developers to construct onchain games and Autonomous Worlds (AWs) within hours, not weeks.
es: Dojo es un audaz trabajo en progreso, con el objetivo de capacitar a los desarrolladores para construir juegos en la cadena y Mundos Autónomos (AWs) en cuestión de horas, no semanas.

source: ### Organizational Structure
es: ### Estructura Organizacional

source: Dojo is an open-source initiative, licensed under MIT, dedicated to promoting and advancing the concept of Autonomous Worlds (AWs). It is spearheaded by [Cartridge](https://cartridge.gg/), [Realms & BibliothecaDAO](https://bibliothecadao.xyz/), [briq](https://briq.construction/) and many more [contributors](https://github.com/orgs/dojoengine/people).
es: Dojo es una iniciativa de código abierto, con licencia MIT, dedicada a promover y avanzar en el concepto de Mundos Autónomos (AWs). Es liderado por [Cartridge](https://cartridge.gg/), [Realms & BibliothecaDAO](https://bibliothecadao.xyz/), [briq](https://briq.construction/) y muchos otros [colaboradores](https://github.com/orgs/dojoengine/people).

source: ### How do I get involved?
es: ### ¿Cómo puedo involucrarme?

source: Check out our [Github](https://github.com/dojoengine), our [Twitter](https://twitter.com/dojostarknet), [Discord](https://discord.gg/vUN4Xq9Qv6) and [contribution guide](https://book.dojoengine.org/misc/contributors.html!)
es: Visita nuestro [Github](https://github.com/dojoengine), [Twitter](https://twitter.com/dojostarknet), [Discord](https://discord.gg/vUN4Xq9Qv6) y [guía de contribución](https://book.dojoengine.org/misc/contributors.html!).

source: ## Autonomous Worlds
es: ## Mundos Autónomos

source: > "Autonomous worlds represent persistent, permissionless, and decentralized open environments that users can freely interact with and contribute to."
es: > "Los mundos autónomos representan entornos abiertos, persistentes, sin permisos y descentralizados, en los que los usuarios pueden interactuar y contribuir libremente."

source: The precise definition of Autonomous Worlds (AWs) remains somewhat elusive, as it is more of an abstract concept that has yet to be fully crystallized. Lattice first [introduced](https://0xparc.org/blog/autonomous-worlds) the terminology in 2022, but the notion of open worlds operating on the blockchain has been around for a while. The abstraction introduced by MUD served as a catalyst for the market to recognize the potential of these worlds.
es: La definición precisa de los Mundos Autónomos (AWs, por sus siglas en inglés) sigue siendo algo escurridiza, ya que es más bien un concepto abstracto que aún no se ha cristalizado completamente. Lattice [introdujo](https://0xparc.org/blog/autonomous-worlds) por primera vez el término en 2022, pero la noción de mundos abiertos que operan en la cadena de bloques ha existido durante un tiempo. La abstracción presentada por MUD sirvió como un catalizador para que el mercado reconociera el potencial de estos mundos.

source: Autonomous Worlds share notable similarities with blockchains in their fundamental nature. Once established, they persist, maintaining their state throughout the lifespan of the chain. Players can join or leave, and developers can expand these worlds by deploying features in a permissionless manner, much like how contracts are added to a chain. While there is no universally accepted definition for an Autonomous World, we believe that a game must possess at least the following two essential features to be considered as such:
es: Los Mundos Autónomos comparten similitudes destacadas con las cadenas de bloques en su naturaleza fundamental. Una vez establecidos, persisten y mantienen su estado a lo largo de la vida útil de la cadena. Los jugadores pueden unirse o salir, y los desarrolladores pueden ampliar estos mundos desplegando características de manera sin permisos, de manera similar a cómo se añaden contratos a una cadena. Aunque no existe una definición universalmente aceptada para un Mundo Autónomo, creemos que un juego debe poseer al menos las siguientes dos características esenciales para ser considerado como tal:

source: 1. Decentralized data availability layer: While the state execution may reside on a centralized layer, it is crucial that the state can be reconstructed if the execution layer ceases to exist. Rollups offer a solution, providing increased capacity execution layers while ensuring data is permanently settled on Ethereum. This guarantees the world's perpetual persistence. 2. Permissionless entry point for expanding the world: The World contract must be capable of accepting new systems and components without requiring permission. While this doesn't imply that every component and system will be utilized, they must adhere to this pattern, ensuring open and unrestricted access for potential enhancements.
es: 1. Capa de disponibilidad de datos descentralizada: Si bien la ejecución del estado puede residir en una capa centralizada, es crucial que el estado pueda reconstruirse si la capa de ejecución deja de existir. Los Rollups ofrecen una solución al proporcionar capas de ejecución con mayor capacidad mientras aseguran que los datos se asienten permanentemente en Ethereum. Esto garantiza la persistencia perpetua del mundo. 2. Punto de entrada sin permisos para expandir el mundo: El contrato del Mundo debe ser capaz de aceptar nuevos sistemas y componentes sin requerir permiso. Si bien esto no implica que cada componente y sistema se utilizará, deben adherirse a este patrón, garantizando un acceso abierto e irrestricto para posibles mejoras.

source: We're firm believers in the potential for Autnomous Worlds to catalize the exploration of novel forms in the medium provided by zk proofs and blockchain technology. This is not only about games, but also about new forms of artwork, coordination, fun, emerging from tinkering and radical innovation, eventually questioning the very notion of "play" in this brave new decentralized and trustless world.
es: Somos firmes creyentes en el potencial de los Mundos Autónomos para catalizar la exploración de nuevas formas en el medio proporcionado por las pruebas zk y la tecnología blockchain. Esto no se trata solo de juegos, sino también de nuevas formas de arte, coordinación, diversión, surgidas de experimentar e innovar radicalmente, cuestionando en última instancia la misma noción de "jugar" en este valiente y descentralizado mundo sin confianza.

source: ### Homework
es: ### Tarea

source: Cairo is an open-source, Turing-complete smart contract language developed by Starkware, designed to power the Validity Rollup Starknet. The language enables highly expressive and verifiable computation, making it well-suited for building scalable and secure applications, including decentralized finance (DeFi) projects.
es: Cairo es un lenguaje de contratos inteligentes de código abierto y Turing completo, desarrollado por Starkware, diseñado para impulsar el Validity Rollup Starknet. El lenguaje permite una computación altamente expresiva y verificable, lo que lo hace adecuado para construir aplicaciones escalables y seguras, incluidos proyectos de finanzas descentralizadas (DeFi)

source: Dojo builds on Cairo to create a robust framework for developing Autonomous Worlds (AWs). By leveraging the capabilities of Cairo, Dojo aims to streamline the development process, improve maintainability, and enhance the performance of AWs.
es: Dojo se basa en Cairo al crear un framework para desarrollar Mundos Autonomos (AWs). Al aprovechar las capacidades de Cairo, Dojo tiene como objetivo agilizar el proceso de desarrollo, mejorar la mantenibilidad y mejorar el rendimiento de AWs.

source: A key feature of the Dojo framework is its use of [commands](../framework/cairo/commands.md). Commands are a design pattern that helps to reduce boilerplate code, resulting in cleaner and more maintainable applications. They achieve this by encapsulating specific actions or operations within self-contained, reusable units.
es: Una característica clave del Dojo framework es el uso de [comandos](../framework/cairo/commands.md). Los comandos son un patrón de diseño que ayuda a reducir el código repetitivo, lo que resulta en aplicaciones más limpias y fáciles de mantener. Logran esto encapsulando acciones u operaciones específicas dentro de unidades autocontenidas y reutilizables.

source: Developers can write commands freely within Systems, and the Cairo compiler takes care of inlining the appropriate functions.
es: Los desarrolladores pueden escribir comandos libremente dentro de los Sistemas, y el compilador de Cairo se encarga de enlazar las funciones apropiadas.

source: #### Essential Reading
es: #### Lectura Esencial

source: ### Starknet as an L2
es: ### Starknet como una L2

source: Starknet is a Validity Rollup Layer 2 (L2) solution designed to scale Ethereum. It operates by offering high transaction throughput and low gas costs while maintaining the same level of security as Ethereum Layer 1 (L1). The strategy it uses is akin to solving a sudoku puzzle: verifying a solution is easier than finding the solution from scratch. Similarly, Starknet replaces heavy and costly L1 computation with cheaper L1 verification through the use of STARK proofs computed off-chain.
es: Starknet es una solución de Capa 2 (L2) de Validity Rollup diseñada para escalar Ethereum. Opera ofreciendo una alta capacidad de transacciones y bajos costos de gas, manteniendo el mismo nivel de seguridad que Ethereum Capa 1 (L1). La estrategia que utiliza es similar a resolver un rompecabezas Sudoku: verificar una solución es más fácil que encontrar la solución desde cero. De manera similar, Starknet reemplaza la computación pesada y costosa en L1 con una verificación más económica en L1 mediante el uso de pruebas STARK calculadas fuera de la cadena.

source: In more technical terms, Starknet is a permissionless Validity-Rollup (also known as a "ZK-Rollup") that supports general computation and currently runs as an L2 network over Ethereum. The network's L1 security is guaranteed by its utilization of the STARK cryptographic proof system, which is considered one of the safest and most scalable.
es: En términos más técnicos, Starknet es un Validity-Rollup sin permisos (también conocido como "ZK-Rollup") que admite computación general y actualmente funciona como una red L2 sobre Ethereum. La seguridad de la red L1 está garantizada por su utilización del sistema de prueba criptográfica STARK, que se considera uno de los más seguros y escalables.

source: ### Starknet as an Appchain
es: ### Starknet como una Appchain

source: Cairo is an isomorphic, general-purpose language, optimized for Zero-Knowledge (ZK) proofs. It's the driving force behind Starknet, Starkex, and appchains. Remarkably, you can also run it in WebAssembly (WASM) to generate proofs on the client-side! The Dojo team is working closely with the [Madara](https://github.com/keep-starknet-strange/madara) team to enable Starknet appchains to seamlessly run Dojo worlds.
es: Cairo es un lenguaje isomórfico de propósito general, optimizado para pruebas de conocimiento cero (ZK). Es la fuerza impulsora detrás de Starknet, Starkex y las appchains. Sorprendentemente, también se puede ejecutar en WebAssembly (WASM) para generar pruebas en el lado del cliente! El equipo de Dojo está trabajando en estrecha colaboración con el equipo de [Madara](https://github.com/keep-starknet-strange/madara) para permitir que las appchains de Starknet ejecuten sin problemas los mundos de Dojo.

source: ## Installation
es: ## Instalación

source: ### Precompiled binaries
es: ### Binarios precompilados

source: Precompiled binaries are available from the [GitHub releases page](https://github.com/dojoengine/dojo/releases). These are better managed by using [Dojoup](#using-dojoup).
es: Los binarios precompilados están disponibles en la página de [GitHub releases page](https://github.com/dojoengine/dojo/releases). Es recomendable utilizar [Dojoup](#using-dojoup) para gestionarlos de manera más eficiente.

source: ### Using Dojoup
es: ### Utilizando Dojoup

source: Dojoup is the Dojo toolchain installer. You can find more about it [here](https://github.com/dojoengine/dojo/blob/master/dojoup/README.md).
es: Dojoup es el instalador de la herramienta Dojo. Puedes encontrar más información sobre él [aquí](https://github.com/dojoengine/dojo/blob/master/dojoup/README.md).

source: Open your terminal and run the following command:
es: Abre tu terminal y ejecuta el siguiente comando:

source: This will install Dojoup, then simply follow the instructions on-screen, which will make the `dojoup` command available in your CLI.
es: Esto instalará Dojoup, luego simplemente sigue las instrucciones que aparecen en pantalla, lo que hará que el comando `dojoup` esté disponible en tu línea de comandos (CLI).

source: Running `dojoup` by itself will install the latest (nightly) [precompiled binaries](#precompiled-binaries): `sozo`, `katana`, and `torii`. See `dojoup --help` for more options, like installing from a specific version or commit.
es: Ejecutar `dojoup` por sí mismo instalará las últimas versiones (nightly) de [binarios precompilados](#precompiled-binaries): `sozo`, `katana`, and `torii`. Consulta `dojoup --help` para más opciones, como instalar desde una versión o commit específico.

source: > ℹ️ **Note** > > If you're on Windows, you will need to install and use [Git BASH](https://gitforwindows.org/) or [WSL](https://learn.microsoft.com/en-us/windows/wsl/install), > as your terminal, since Dojoup currently does not support Powershell or Cmd.
es: > ℹ️ **nota** > > Si estás en Windows, deberás instalar y utilizar [Git BASH](https://gitforwindows.org/) o [WSL](https://learn.microsoft.com/en-us/windows/wsl/install), > como tu terminal, ya que actualmente Dojoup no es compatible con Powershell o Cmd.

source: ### Building from source
es: ### Compilando desde el código fuente

source: #### Prerequisites
es: #### Requisitos previos

source: You will need the [Rust](https://rust-lang.org) compiler and Cargo, the Rust package manager. The easiest way to install both is with [`rustup.rs`](https://rustup.rs/).
es: Necesitarás el compilador de [Rust](https://rust-lang.org) y Cargo, el gestor de paquetes de Rust. La forma más sencilla de instalar ambos es utilizando [`rustup.rs`](https://rustup.rs/).

source: On Windows, you will also need a recent version of [Visual Studio](https://visualstudio.microsoft.com/downloads/), installed with the "Desktop Development With C++" Workloads option.
es: En Windows, también necesitarás una versión reciente de [Visual Studio](https://visualstudio.microsoft.com/downloads/), instalada con la opción "Desarrollo de escritorio con C++" en las cargas de trabajo.

source: #### Building
es: #### Compilando

source: You can either use the different [Dojoup](#using-dojoup) flags:
es: Puedes utilizar las diferentes opciones de [Dojoup](#using-dojoup):

source: Or, by using a single Cargo command:
es: O bien, utilizando un solo comando de Cargo:

source: Or, by manually building from a local copy of the [Dojo repository](https://github.com/dojoengine/dojo):
es: O bien, construyendo manualmente desde una copia local del [repositorio de Dojo](https://github.com/dojoengine/dojo):

source: # Dojo Engine - Getting Started Guide
es: # Motor de Dojo - Guía de Inicio

source: This README guides you through the process of setting up your local development environment for Dojo.
es: Este archivo README te guiará a través del proceso de configurar tu entorno de desarrollo local para Dojo.

source: ## Prerequisites
es: ## Requisitos previos

source: ## Clone the Repository
es: ## Clonar el repositorio

source: First, clone the repository to your local machine:
es: Primero, clona el repositorio en tu máquina local:

source: ## Setup Guide
es: ## Guía de configuración

source: #### 1. Install Rust and Dependencies
es: #### 1. Instalar Rust y dependencias
