Repository: dpinones/dojo-book
Catalog: po/*.po
Languages: es

source: This section covers an extensive list of information about Mining Modes, Supported RPC Methods, Katana flags and their usages. You can run multiple flags at the same time.
es: Esta sección cubre una extensa lista de información sobre los Modos de Minería, los Métodos de RPC Soportados, los flags de Katana y sus usos. Puedes ejecutar múltiples flags al mismo tiempo.

source: #### Mining Modes
es: #### Modos de Minería

source: Mining modes refer to how frequent blocks are mined using Katana. By default, it automatically generates a new block as soon as a transaction is submitted.
es: Los modos de minería se refieren a la frecuencia con la que se minan bloques utilizando Katana. Por defecto, Katana genera automáticamente un nuevo bloque tan pronto como se envía una transacción.

source: You can change this setting to interval mining if you will, which means that a new block will be generated in a given period of time selected by the user. If you want to go for this type of mining, you can do it by adding the `--block-time <block-time-in-seconds>` flag, like in the following example.
es: Puedes cambiar esta configuración a la minería por intervalos si así lo deseas, lo que significa que se generará un nuevo bloque en un período de tiempo específico seleccionado por el usuario. Si deseas optar por este tipo de minería, puedes hacerlo agregando la bandera `--block-time <tiempo-de-bloque-en-segundos>`, tal como se muestra en el siguiente ejemplo.

source: #### Supported Transport Layers
es: #### Capas de Transporte Soportadas

source: Only HTTP connection is supported at the moment. The server listens on port 5050 by default, but it can be changed by running the following command:
es: Actualmente, solo se admite la conexión HTTP. El servidor escucha en el puerto 5050 de forma predeterminada, pero se puede cambiar ejecutando el siguiente comando:

source: #### Starknet Feature Compatibility
es: #### Compatibilidad de características de Starknet

source: ##### Supported Transaction Type
es: ##### Tipos de transacciones admitidas

source: #### Supported RPC Methods
es: #### Métodos RPC Soportados

source: ##### Starknet Methods
es: ##### Metodos de Starknet

source: Katana supports version **v0.3.0** of the Starknet JSON-RPC specifications. The standard methods are based on [this](https://github.com/starkware-libs/starknet-specs/tree/v0.3.0) reference.
es: Katana soporta la versión **v0.3.0** de las especificaciones Starknet JSON-RPC. Los métodos estándar se basan en [esta](https://github.com/starkware-libs/starknet-specs/tree/v0.3.0) referencia.

source: ##### Custom Methods
es: ##### Métodos Personalizados

source: Katana provides a convenient set of custom RPC methods to quickly and easily configure the node to suit your testing environment.
es: Katana proporciona un conjunto conveniente de métodos RPC personalizados para configurar rápidamente y fácilmente el nodo según las necesidades de tu entorno de pruebas.

source: `katana_generateBlock` Mine a new block which includes all currently pending transactions
es: `katana_generateBlock` Genera un nuevo bloque que incluye todas las transacciones pendientes en el momento

source: `katana_nextBlockTimestamp` Get the time for the next block
es: `katana_nextBlockTimestamp` Obtiene el tiempo estimado para el próximo bloque

source: `katana_increaseNextBlockTimestamp` Increase the time for the block by a given amount of time, in seconds
es: `katana_increaseNextBlockTimestamp` Aumenta el tiempo estimado para el próximo bloque en una cantidad específica de tiempo, en segundos

source: `katana_setNextBlockTimestamp` Similar to `katana_increaseNextBlockTimestamp` but takes the exact timestamp that you want in the next block
es: `katana_setNextBlockTimestamp` Similar a `katana_increaseNextBlockTimestamp`, pero permite establecer el tiempo exacto que deseas en el próximo bloque

source: `katana_predeployedAccounts` Get the info for all of the predeployed accounts
es: `katana_predeployedAccounts` Obtiene la información de todas las cuentas pre-implementadas (predeployed accounts)

source: ### OPTIONS
es: ### OPCIONES

source: #### General Options
es: #### Opciones Generales

source: `--silent` &nbsp;&nbsp;&nbsp;&nbsp; Don't print anything on startup
es: `--silent` &nbsp;&nbsp;&nbsp;&nbsp; sin mostrar mensajes en la pantalla durante el inicio

source: `--no-mining` &nbsp;&nbsp;&nbsp;&nbsp; Disable auto and interval mining, and mine on demand instead
es: `--no-mining` &nbsp;&nbsp;&nbsp;&nbsp; Desactivar la minería automática e intervalos, y en su lugar minar bajo demanda

source: `-b, --block-time <SECONDS>` &nbsp;&nbsp;&nbsp;&nbsp; Block time in seconds for interval mining
es: `-b, --block-time <SEGUNDOS>` &nbsp;&nbsp;&nbsp;&nbsp; Tiempo de bloque en segundos para la minería por intervalos

source: `-h, --help` &nbsp;&nbsp;&nbsp;&nbsp; Print help (see a summary with '-h')
es: `-h, --help` &nbsp;&nbsp;&nbsp;&nbsp; Imprimir ayuda (ver un resumen con '-h').

source: `-V, --version` &nbsp;&nbsp;&nbsp;&nbsp; Print version information
es: `-V, --version` &nbsp;&nbsp;&nbsp;&nbsp; Imprimir información de la versión

source: #### Server Options
es: #### Opciones del servidor

source: `-p, --port <PORT>` &nbsp;&nbsp;&nbsp;&nbsp; Port number to listen on [default: 5050]
es: `-p, --port <PUERTO>` &nbsp;&nbsp;&nbsp;&nbsp; Número de puerto en el que escuchar [por defecto: 5050].

source: `--host <HOST>` &nbsp;&nbsp;&nbsp;&nbsp; The IP address the server will listen on
es: `--host <ANFITRIÓN>` &nbsp;&nbsp;&nbsp;&nbsp; La dirección IP en la que el servidor escuchará

source: #### Starknet Options
es: #### Opciones de Starknet

source: `--seed <SEED>` &nbsp;&nbsp;&nbsp;&nbsp; Specify the seed for randomness of accounts to be predeployed
es: `--seed <SEMILLA>` &nbsp;&nbsp;&nbsp;&nbsp; Especificar la semilla para la aleatoriedad de las cuentas que serán pre-implementadas (predeployed accounts)

source: `--accounts <NUM>` &nbsp;&nbsp;&nbsp;&nbsp; Number of pre-funded accounts to generate [default: 10]
es: `--accounts <NUM>` &nbsp;&nbsp;&nbsp;&nbsp; Número de cuentas pre-financiadas para generar [por defecto: 10].

source: `--allow-zero-max-fee` &nbsp;&nbsp;&nbsp;&nbsp; Allow transaction max fee to be zero
es: `--allow-zero-max-fee` &nbsp;&nbsp;&nbsp;&nbsp; Permitir que la tarifa máxima de la transacción sea cero

source: #### Environment Options
es: #### Opciones de entorno

source: `--chain-id <CHAIN_ID>` &nbsp;&nbsp;&nbsp;&nbsp; The chain ID [default: KATANA]
es: `--chain-id <ID_CADENA>` &nbsp;&nbsp;&nbsp;&nbsp; El ID de la cadena [por defecto: KATANA].

source: `--gas-price <GAS_PRICE>` &nbsp;&nbsp;&nbsp;&nbsp; The gas price
es: `--gas-price <PRECIO_GAS>` &nbsp;&nbsp;&nbsp;&nbsp; El precio del gas

source: ### EXAMPLES
es: ### EJEMPLOS

source: 1. Set the number of accounts to 15 and allow zero fee transaction
es: 1. Establecer el número de cuentas en 15 y permitir transacciones sin tarifas

source: 2. Set the chain id SN_GOERLI and run the server on port 8545
es: 2. Establecer el ID de cadena en SN_GOERLI y ejecutar el servidor en el puerto 8545

source: ## Contributing to Dojo Book
es: ## Contribuyendo al Libro de Dojo

source: As the Dojo engine progresses and develops, it is essential for the Dojo book to keep pace with these advancements. Updating and refining the book ensures that it remains a relevant and valuable resource for those interested in understanding and utilizing the latest Dojo engine features and capabilities. All help is welcome!
es: Conforme el motor de Dojo avanza y se desarrolla, es fundamental que el Libro de Dojo se mantenga al día con estos avances. Actualizar y perfeccionar el libro garantiza que siga siendo un recurso relevante y valioso para aquellos interesados en comprender y utilizar las últimas características y capacidades del motor de Dojo. ¡Toda ayuda es bienvenida!

source: ### The purpose of the book
es: ### El propósito del libro es

source: The Dojo book is designed to be a comprehensive resource that caters to users at various levels of experience. It aims to serve as both an introductory guide for those new to Dojo and its ancillary packages, as well as a reference for more experienced users seeking to deepen their understanding of the engine's features and capabilities.
es: El libro de Dojo está diseñado para ser un recurso completo que atienda a usuarios de varios niveles de experiencia. Su objetivo es servir como una guía introductoria para aquellos que son nuevos en Dojo y sus paquetes complementarios, así como una referencia para usuarios más experimentados que buscan profundizar su comprensión de las características y capacidades del motor.

source: The book is split into some major chapters:
es: El libro está dividido en varios capítulos principales:

source: - Framework Theory - Getting Started - Building a World
es: - Teoría del Framework - Comenzando - Construyendo un Mundo

source: ### Code of Conduct
es: ### Código de conducta

source: The book follows the [Rust Code of Conduct](https://www.rust-lang.org/policies/code-of-conduct).
es: El libro sigue el [Rust Code of Conduct](https://www.rust-lang.org/policies/code-of-conduct).

source: ### Ways to contribute
es: ### Formas de contribuir

source: If you think that some content is missing or out-of-date, feel free to open an issue. If you find multiple pieces of content lacking, please open up a separate issue for each.
es: Si consideras que falta algún contenido o que alguna información está desactualizada, no dudes en abrir un 'issue' al respecto. Si encuentras varias partes del contenido que necesitan ser complementadas, por favor, abre un 'issue' separado para cada una.

source: The issues will then be labeled so other contributors can find chunks of work they are interested in more easily.
es: Luego, los 'issues' serán etiquetados para que otros colaboradores puedan encontrar áreas de trabajo que les interesen más fácilmente.

source: The issue should contain what is missing, or what could be improved, in as much detail as you deem necessary.
es: El 'issue' debe contener lo que falta o lo que podría mejorar, con todos los detalles que consideres necesarios.

source: Feel free to contribute changes to the book by opening a pull request - anything is welcome, from reformulating a sentence, fixing a typo, to adding new sections or chapters.
es: Siéntete libre de contribuir con cambios al libro abriendo un PR (pull request). Todo es bienvenido, desde reformular una oración, corregir un error tipográfico hasta agregar nuevas secciones o capítulos.

source: When your pull request is open, other contributors will take a look and may request changes. Do not be discouraged!
es: Cuando tu pull request esté abierto, otros colaboradores lo revisarán y podrían solicitar cambios. ¡No te desanimes!

source: ### Writing style
es: ### Estilo de escritura

source: This section documents a few standards for writing used throughout the book.
es: Esta sección documenta algunos estándares de escritura utilizados a lo largo del libro.

source: #### Chapters start with a second level heading
es: #### Los capítulos comienzan con un encabezado de segundo nivel

source: We use:
es: Nosotras usamos:

source: We do not use:
es: Nosotras no usamos:
